Revit 2027 API
ConductorSize.Diameter Property
 The diameter of the conductor.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
public:
property double Diameter {
	double get ();
	void set (double value);
}
member Diameter : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for diameter is not finite -or- When setting this property: The given value for diameter is not a number
ArgumentOutOfRangeException |  When setting this property: The given value for diameter must be non-negative.
See Also
Reference
ConductorSize Class
Autodesk.Revit.DB.Electrical Namespace